{"class_name": "Model", "keras_version": "2.0.4", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 28, 28, 1], "sparse": false}}, {"class_name": "Sequential", "name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "padding": "same", "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 16, "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "data_format": "channels_last", "name": "zero_padding2d_1", "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}]}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "config": {"use_bias": true, "trainable": true, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "config": {"use_bias": true, "trainable": true, "bias_constraint": null, "units": 11, "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}], "name": "model_1"}, "backend": "tensorflow"}