{"class_name": "Model", "keras_version": "2.0.4", "config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["sequential_2", 1, 0]], "layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"dtype": "int32", "name": "input_3", "batch_input_shape": [null, 1], "sparse": false}}, {"class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"input_length": null, "embeddings_constraint": null, "input_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "embeddings_regularizer": null, "trainable": true, "output_dim": 100, "dtype": "int32", "mask_zero": false, "name": "embedding_1", "batch_input_shape": [null, null], "activity_regularizer": null}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 100], "sparse": false}}, {"class_name": "Flatten", "name": "flatten_2", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Multiply", "name": "multiply_1", "inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "config": {"name": "multiply_1", "trainable": true}}, {"class_name": "Sequential", "name": "sequential_2", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": [{"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "units": 6272, "batch_input_shape": [null, 100], "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "name": "dense_3", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Reshape", "config": {"target_shape": [7, 7, 128], "name": "reshape_1", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [4, 4], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_5", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [4, 4], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_6", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [4, 4], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_7", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "tanh", "trainable": true}}]}], "name": "model_2"}, "backend": "tensorflow"}