{"class_name": "Model", "keras_version": "2.0.4", "config": {"input_layers": [["input_4", 0, 0], ["input_5", 0, 0]], "output_layers": [["model_1", 1, 0], ["model_1", 1, 1]], "layers": [{"class_name": "InputLayer", "name": "input_4", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_4", "batch_input_shape": [null, 100], "sparse": false}}, {"class_name": "InputLayer", "name": "input_5", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_5", "batch_input_shape": [null, 1], "sparse": false}}, {"class_name": "Model", "name": "model_2", "inbound_nodes": [[["input_4", 0, 0, {}], ["input_5", 0, 0, {}]]], "config": {"name": "model_2", "output_layers": [["sequential_2", 1, 0]], "layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"dtype": "int32", "name": "input_3", "batch_input_shape": [null, 1], "sparse": false}}, {"class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "embeddings_constraint": null, "input_dim": 10, "input_length": null, "output_dim": 100, "trainable": true, "embeddings_regularizer": null, "dtype": "int32", "mask_zero": false, "name": "embedding_1", "batch_input_shape": [null, null], "activity_regularizer": null}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 100], "sparse": false}}, {"class_name": "Flatten", "name": "flatten_2", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Multiply", "name": "multiply_1", "inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "config": {"name": "multiply_1", "trainable": true}}, {"class_name": "Sequential", "name": "sequential_2", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": [{"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "units": 6272, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 100], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Reshape", "config": {"target_shape": [7, 7, 128], "name": "reshape_1", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_5", "kernel_regularizer": null, "kernel_size": [4, 4], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_6", "kernel_regularizer": null, "kernel_size": [4, 4], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_7", "kernel_regularizer": null, "kernel_size": [4, 4], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "tanh", "trainable": true}}]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]]}}, {"class_name": "Model", "name": "model_1", "inbound_nodes": [[["model_2", 1, 0, {}]]], "config": {"name": "model_1", "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 28, 28, 1], "sparse": false}}, {"class_name": "Sequential", "name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "strides": [2, 2], "dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "strides": [2, 2], "name": "conv2d_2", "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "name": "zero_padding2d_1", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "strides": [2, 2], "name": "conv2d_3", "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_4", "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}]}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "config": {"use_bias": true, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "units": 1, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "config": {"use_bias": true, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_2", "units": 11, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}], "input_layers": [["input_1", 0, 0]]}}], "name": "model_3"}, "backend": "tensorflow"}